ASSISTANCE_MESSAGE = (
    "Чтобы обратиться в поддержку, воспользуйтесь формой по ссылке ниже."
)
HELP_MESSAGE = (
    "  Что умеет этот бот?\n"
    "  Здесь мы подбираем пары для Random Coffee между студентами "
    "курса IT-рекрутер и выпускниками IT-профессий Практикума.\n"
    "  Если вы новый пользователь, бот предложит познакомиться, если у "
    "Вас возникли сложности в работе, или пожелания - "
    "можете написать в поддержку"
)
START_MESSAGE = (
    "Наш бот предлагает тебе поучаствовать в неформальном разговоре с "
    'выпускником Практикума. Для этого необходимо нажать на кнопку "Go". '
    "Если вы не готовы на этой неделе участвовать в "
    'Random Coffee просто нажмите "В следующий раз".'
)
NEXT_TIME_MESSAGE = (
    "Будем ждать Вас снова! Когда будете готовы, "
    "снова запустите бот командой \n /start"
)
