ASSISTANCE_MESSAGE = (
    "Чтобы обратиться в поддержку, воспользуйся формой по ссылке ниже."
)
HELP_MESSAGE = (
    "  Что умеет этот бот?\n"
    "  Здесь мы подбираем пары для Random Coffee между студентами "
    "курса IT-рекрутер и выпускниками IT-профессий Практикума.\n"
    "Если ты новый пользователь, бот предложит познакомиться. "
    "Если у тебя возникли сложности в работе или пожелания, "
    "можешь написать в поддержку"
)
START_MESSAGE = (
    "Наш бот предлагает тебе поучаствовать в неформальном разговоре с "
    'выпускником Практикума. Для этого необходимо нажать на кнопку "Go". '
    "Если ты не готов на этой неделе участвовать в "
    'Random Coffee просто нажми "В следующий раз".'
)
NEXT_TIME_MESSAGE = (
    "Будем ждать тебя снова. "
    "Когда будешь готов, запусти бота командой /start"
)
CHOOSE_ROLE_MESSAGE = "Укажи, пожалуйста, свою роль:"
PAIR_SEARCH_MESSAGE = "Ищу тебе пару!\nКак только найду, обязательно сообщу!"
GUESS_NAME_MESSAGE = (
    'Тебя зовут {}?\nЕсли все верно, нажми "Продолжить"\n'
    "Если хочешь поправить, пожалуйста, нажми на кнопку "
    '"Сменить имя"'
)
CHANGE_NAME_MESSAGE = "Напиши свое имя:"
CHOOSE_PROFESSION_MESSAGE = "Укажи, пожалуйста, свою профессию:"
USERNAME_NOT_FOUND_MESSAGE = (
    "Не удалось автоматически получить твой никнейм.\n"
    "Введите, пожалуйста, номер телефона:\n"
    "Пример ввода: +7(111)111-11-11"
)
PROFILE_MESSAGE = (
    "Твой профиль:\n" "Имя: {}\n" "Профессия: {}\n" "Telegram: @{}"
)
PROFILE_MESSAGE_NO_USERNAME = (
    "Твой профиль:\n" "Имя: {}\n" "Профессия: {}\n" "Контакты: {}"
)
START_PAIR_SEARCH_MESSAGE = "Начать поиск пары?"
IS_PAIR_SUCCESSFUL_MESSAGE = "Удалось ли созвониться? Спасибо :)"
FOUND_PAIR = (
    "Твоя пара на эту неделю:\n"
    "Имя: {}\n"
    "Профессия: {}\n"
    "Telegram: @{}\n"
    "Напиши своему напарнику приветствие и предложи удобные дни и\n"
    "время для созвона. В разговоре ты сможешь опираться на этот гайд\n"
    "{}"
)
FOUND_PAIR_NO_USERNAME = (
    "Твоя пара на эту неделю:\n"
    "Имя: {}\n"
    "Профессия: {}\n"
    "Контакты: {}\n"
    "Напиши своему напарнику приветствие и предложи удобные дни и\n"
    "время для созвона. В разговоре ты сможешь опираться на этот гайд\n"
    "{}"
)
POST_CALL_MESSAGE_FOR_STUDENT = (
    "Спасибо большое за участие. Оставить \n"
    "обратную связь можно в канале \n"
    "Communication в твоей когорте. Если тебе\n"
    "захочется поучаствовать еще раз, просто\n"
    'нажми кнопку "Go". Если пока не готов\n'
    'участвовать, нажми кнопку "В следующий раз".'
)
POST_CALL_MESSAGE_FOR_RECRUITER = (
    "Спасибо большое за участие. Оставить \n"
    "обратную связь можно здесь {}. Если \n"
    "тебе захочется поучаствовать еще раз, просто\n"
    'нажми кнопку "Go". Если пока не готов\n'
    'участвовать, нажми кнопку "В следующий раз".'
)
USER_DELETE_MESSAGE = (
    "Тебя исключили из базы данных как {}, "
    "теперь ты можешь зарегистрироваться заново."
)
POST_CALL_MESSAGE = (
    "Нам очень жаль, что у вас не вышло,\n"
    "пожалуйста, заполни форму {}. \n"
    "Eсли тебе захочется\n"
    "поучаствовать еще раз, просто\n"
    'нажми кнопку "Go". Если пока не готов\n'
    'участвовать, нажми кнопку "В следующий раз".'
)
MESSAGE_INCORRECT_PHONE_NUMBER = (
    "Некорректный номер телефона.\n" "Введите заново:"
)
NOT_REGISTRED_MESSAGE = (
    "Вас нет в зарегистрированных\n"
    "пользователях, для того, чтобы начать\n"
    "нажмите /start"
)
CONFIRMATION_DELETE_ACCOUNT_MESSAGE = (
    "Ваша профессия {}.\n" "Хотите удалить аккаунт?"
)
ACCOUNT_DELETED_MESSAGE = (
    "Ваш аккаунт удален, если хотите\n" "продолжить нажмите старт"
)
