START_MESSAGE = (
    "Наш бот предлагает тебе поучаствовать в неформальном разговоре с "
    'выпускником Практикума. Для этого необходимо нажать на кнопку "Go". '
    "Если вы не готовы на этой неделе участвовать в "
    'Random Coffee просто нажмите "В следующий раз".'
)
NEXT_TIME_MESSAGE = (
    "Будем ждать вас снова. "
    "Когда будете готовы, запустите бота командой /start"
)
CHOOSE_ROLE_MESSAGE = "Укажите, пожалуйста, свою роль:"
PAIR_SEARCH_MESSAGE = "Ищу тебе пару!\nКак только найду, обязательно сообщу!"
GUESS_NAME_MESSAGE = (
    'Тебя зовут {}?\nЕсли я угадал, нажми "Продолжить"\n'
    "Если хочешь поправить, пожалуйста, нажми на кнопку"
    '"Сменить имя"'
)
