ASSISTANCE_MESSAGE = (
    "Чтобы обратиться в поддержку, воспользуйтесь формой по ссылке ниже."
)
HELP_MESSAGE = (
    "  Что умеет этот бот?\n"
    "  Здесь мы подбираем пары для Random Coffee между студентами "
    "курса IT-рекрутер и выпускниками IT-профессий Практикума.\n"
    "  Если вы новый пользователь, бот предложит познакомиться, если у "
    "Вас возникли сложности в работе, или пожелания - "
    "можете написать в поддержку"
)
START_MESSAGE = (
    "Наш бот предлагает тебе поучаствовать в неформальном разговоре с "
    'выпускником Практикума. Для этого необходимо нажать на кнопку "Go". '
    "Если вы не готовы на этой неделе участвовать в "
    'Random Coffee просто нажмите "В следующий раз".'
)
NEXT_TIME_MESSAGE = (
    "Будем ждать вас снова. "
    "Когда будете готовы, запустите бота командой /start"
)
CHOOSE_ROLE_MESSAGE = "Укажите, пожалуйста, свою роль:"
PAIR_SEARCH_MESSAGE = "Ищу тебе пару!\nКак только найду, обязательно сообщу!"
GUESS_NAME_MESSAGE = (
    'Тебя зовут {}?\nЕсли все верно, нажми "Продолжить"\n'
    "Если хочешь поправить, пожалуйста, нажми на кнопку "
    '"Сменить имя"'
)
CHANGE_NAME_MESSAGE = "Напиши свое имя:"
CHOOSE_PROFESSION_MESSAGE = "Укажи, пожалуйста, свою профессию:"
USERNAME_NOT_FOUND_MESSAGE = (
    "Не удалось автоматически получить твой никнейм.\n"
    "Введите, пожалуйста, номер телефона:"
)
PROFILE_MESSAGE = (
    "Твой профиль:\n" "Имя: {}\n" "Профессия: {}\n" "Telegram: {}"
)
START_PAIR_SEARCH_MESSAGE = "Начать поиск пары?"
IS_PAIR_SUCCESSFUL_MESSAGE = "Удалось ли созвониться? Спасибо :)"
FOUND_PAIR = (
    "Твоя пара на эту неделю:\n"
    "Имя: {}\n"
    "Профессия: {}\n"
    "Telegram: {}\n"
    "Напиши своему напарнику приветствие и предложи удобные дни и\n"
    "время для созвона. В разговоре ты сможешь опираться на этот гайд\n"
    "{}"
)
POST_CALL_MESSAGE_FOR_STUDENT = (
    "Спасибо большое за участие. Оставить\n"
    "обратную связь можно в канале"
    "Communication в твоей когорте. Если тебе\n"
    "захочется поучавствовать еще раз, просто\n"
    'нажми кнопку "Go".'
)
POST_CALL_MESSAGE_FOR_RECRUITER = (
    "Спасибо большое за участие. Оставить обратную\n"
    "обратную связь можно здесь {} Если"
    "тебе захочется поучавствовать еще раз, просто\n"
    'нажми кнопку "Go". Если пока не готов\n'
    'участвовать, нажми кнопку "В следующий раз".'
)
USER_DELETE_MESSAGE = (
    "Вас исключили из базы данных как {}, "
    "теперь Вы можете зарегистрироваться заново."
)
POST_CALL_MESSAGE = (
    "Нам очень жаль, что у вас не вышло,\n"
    "пожалуйста заполните форму {}. \n"
    "Eсли тебе захочется\n"
    "поучавствовать еще раз, просто\n"
    'нажми кнопку "Go".'
)
